import math

a = 5
b = 2
print('a + b =', a + b)
print('a - b =', a - b)
print('a * b =', a * b)
print('a / b =', a / b)    # Тип результа всегда float!
print('a // b =', a // b)  # Целочисленное деление -> out: 2
print('a % b =', a % b)   # Остаток от деления -> out: 1
print('a ** b =', a ** b) # Возведение в степень -> out: 25
print('(a ** b) ** 0.5 =', (a ** b) ** 0.5) # Извлечение квадрата
print('Извлечение квадрата с помощью модуля math = %7.3f' % math.sqrt(a))  # the same

# Важный момент
print(a + 1)  # out: 6
print(a)  # out: 5

### Синтаксический сахар
a = a + 1  # a += 1
print('a =', a)
a += 1  # a = a + 1
print('a +=', a)
a -= 2  # a = a - 2
print('a -=', a)
a *= 3  # a = a * 3
print('a *=', a)
b /= 4 # b = b / 4
print('b /= %.2f' % b)
a //= 3
print('a //= ', a)
a %= 2
print('a %= ', a)
a += 2
# Длинная арифметика
a **= 300
print(a)
# 
print(float('inf'))  ## Плюс бесконечность. Самое большое число
print(float('-inf')) ## Минус бесконечность. Самое маленькое число

## Важный момент хранение дробных чисел в памяти компьютера
# a = 0.1
# if a * 3 == 0.3:
#     print('Все хорошо')
# else:
#     print('Ничего не понятно!')

## Необходимо применить функцию round()
# if round(a * 3, 2) == 0.3:
#     print('Все хорошо')
# else:
#     print('Ничего не понятно!')