Задача № 1 
Вход: имя (Мужик) Возраст ( 100 )
Выход: Здравствуйте, Мужик 100
а  =  20
б  =  10 
печать ( 'a + b =' , a  +  b )
print ( 'a - b =' , a  -  b )
print ( 'a * b =' , a  *  b )

# Важный момент
print ( a  +  1 )   # out: 10
print ( a )   # out: 5

### Синтаксический сахар
а  =  а  +  1   # а + = 1
печать ( 'а =' , а )
а  + =  1   # а = а + 1
print ( 'а + =' , а )
а  - =  2   # а = а - 2
print ( 'а - =' , а )

# Длинная арифметика
а  ** =  450
печать ( а )
# 
print ( float ( 'inf' ))   ## Плюс бесконечность. Самое большое число
print ( float ( '-inf' )) ## Минус бесконечность. Самое маленькое число

## Важный момент хранения дробных чисел в памяти компьютера
# а = 0,6
# если a * 6 == 0.12:
# print ('Все хорошо')
# еще:
# print ('Ничего не понятно!')
