""" 2. Даны списки. Нужно вернуть список, который состоит из элементов,
       общих для этих двух списков."""
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]


# а = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
# c = []
# d = []
# for ia in a:
#     index = 0
#     while index < len(b):
#         if ia == b[index] and not index in c:
#             c.append(index)
#             d.append(ia)    
#         index +=1
# print(d)
