'''
Задача №2. Шахматная доска
Вход: размер шахматной доски, от 0 до 20
Выход: вывести на экран эту доску, заполняя поля нулями и единицами

Пример:
Вход: 4
Выход:
    0 1 0 1
    1 0 1 0
    0 1 0 1
    1 0 1 0
'''
def My_Chess_board
x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())
...
x20 = int(input))
y20 = int(input))
if (x1 + y1 + x2 + y2...+x20+y20) % 2 == 0:
    print('YES')
else:
    print('NO')
