# Задача №0
# Вход: имя(строка) и возраст(число)
# Выход: Здравствуйте, <name>. Вам <age> лет.
name = input('Введите ваше имя: ')
age = int(input('Введите ваш возраст: '))
print('Здравствуйте,', name,'. Вам', age, 'лет.')
