# Задача №0
# Вход: имя(строка) и возраст(число)
# Выход: Здравствуйте, <name>. Вам <age> лет.

name = input('Введите имя:')
age = input('Ваш возраст:')
print('Здравствуйте,', name, '. Вам', age, 'лет')
