#Задача 1
a = int(input('Введите трехзначное число: '))
b = round(a//100)
print('первая цифра числа: ', b)
c = round(a//10*10, -1)
d = a-c
print('последня цифра числа: ', d)
