#Задача 0
name = input('Введите ваше имя: ')
age = int(input('Введите ваш возраст: '))
print('Здравствуйте, ', name, '. Вам', age, ' лет.')
