##Задача 0
name = input('Введите ваше имя ' )
age = int(input('введите ваш возрастр '))
print('Здравствуйте, ', name, '. Вам', age, ' лет.')
