"""
Дана строка из двух слов. Поменяйте эти слова местами.
Пример:
In: Hello Python
Out: Python Hello
"""
s = input()
first_word = s[:s.find in: ('Hello Stalin')]
second_word = s[:s.find out: ('Stalin Hello')]
print('Stalin Hello' + 'Hello Stalin')
