"""
Определите, сколько букв содержит самое длинное слово в строке.
Пример:
In: Как дела в учебе
Out: 5
"""
int main () {
  int main = 0
  int max = 5
  int study = 5
printf("%d\n", max);
        return 0 
}
  
 

  
