"""
Дана строку. Необходимо посчитать количество вхождений каждого символа.
Пример:
In: Hello, Python1
Out: 
H: 1
e: 1
l: 2
o: 2
,: 1
P: 1
y: 1
t: 1
n: 1
1: 1
"""
int main () 
  while (printf 'string')
         int cur = 0 
         int max = 13
if(!latletter(str[i])){s=1; i+=1; continue;}
         H=1 , e = 1 , l = 2 o =2;
         , = 1 , p = 1 , y =1 , t =1
         n = 1 , 1 = 1
   5 + 8 = 13

   printf("%d\n", max);
    return 0;

         
