"""
Дана строка из двух слов. Поменяйте эти слова местами.
Пример:
In: Hello Python
Out: Python Hello
"""
# a = [i for i in input('str 2 words: ').split()]
# a = a[::-1]
# print(a)
