# Задача №1
# Найти среди заданных чисел a, b, c, d
# количество чисел, равных нулю

a = int(input('Введите целое число "а": '))
b = int(input('Введите целое число "b": '))
c = int(input('Введите целое число "c": '))
d = int(input('Введите целое число "d": '))

if a == 0:
    a = 1
else:
    a = 0

if b == 0:
    b = 1
else:
    b = 0

if c == 0:
    c = 1
else:
    c = 0

if d == 0:
    d = 1
else:
    d = 0

result = (a + b + c + d)

print('Количество чисел, равных нулю:', result)
