"""
Написать 3 функции и оформить решение в виде модуля.
Дан участок земли прямоугольной формы.
Нужно посчитать стоимость самой земли и забора по периметру.

Первая функция принимает в качестве аргументов длину и ширину участка.
Возвращает периметр и площадь.

Вторая функция принимает в качестве аргументов периметр и стоимость погонного метра забора.
Возвращает итоговую сумму.

Третья функция принимает в качестве аргументов площадь и стоимость одного квадратного метра земли.
Возвращает итоговую сумму.
"""
import math

sideA = int(input("Длина: "))
sideB = int(input("Ширина: "))
#Side A = 5
#Side B = 10



S = (A * B) / 2
#S = (5 * 10) / 2
#S = 25

P = A + B
#P = 5 + 10
#P = 15 
return 0

